/* ---------------------------------------------------------------------------------------------------------------------------------- */
const Task1;
/*
  Нека си представим, че имаме играта Скрабъл, където всяка буква носи определен брой точки.
  Съставянето на думи с нашите букви ни носи сумата от точки на всяка една от тях.
  Дефинирайте обект, в който се съдържат точките за всяка една буква (може да комбинирате буквите и по броя точки).
  Напишете функция calculateScore, която смята точките, които получавате, по зададена дума.
  - Заб.1. Можете да използвате вградени методи като map, reduce, filter или което решите, че ще свърши работа за тази задача.
*/

/*
  Точки според съответната буква от азбуката:
  A = 1 ; B = 3 ; C = 3 ; D = 2 ; E = 1 ; F = 4 ; G = 2 ; H = 4 ; I = 1 ; J = 8 ; K = 5 ; L = 1 ; M = 3 ;
  N = 1 ; O = 1 ; P = 3 ; Q = 10 ; R = 1 ; S = 1 ; T = 1 ; U = 1 ; V = 4 ; W = 4 ; X = 8 ; Y = 4 ; Z = 10 ;
*/

/* Пример: calculateScore("score") =>  7 */
const calculateScore = () => {}
/* ---------------------------------------------------------------------------------------------------------------------------------- */

/* ---------------------------------------------------------------------------------------------------------------------------------- */
const Task2;
/*
  Дефинирайте клас ComplexNumbers, който да позволява дефинирането на комплексни числа.
  Класът трябва да позволява извършването на основните аритметични операции с тях:
    -> Абсолютна стойност
    -> Комплексно спрегнато
    -> Събиране
    -> Изваждане
    -> Умножение
    -> Деление
    -> Степенуване
  - Заб.1. Могат да се дефинират и гет функции (гетъри) с ключовата дума get пред метода.
  - Заб.2. Дефинирането на класове изисква използването на this, което ще разгледаме по-подробно по-нататък
  - Заб.3. Можете да използвате методите, които идват от глобалния Math обект в JavaScript.
*/

/* Примерен скелет за имплементацията - може да не отговаря на реалната структура */
class ComplexNumber {
  // constructor
  constructor() {}
  // getter
  get value() {}
  // methods
  add() {}
  subtract() {}
  multiply() {}
  divide() {}
  absolute() {}
  conjugate() {}
  exponentiate() {}
}

const complexNumber = new ComplexNumber()
/* ---------------------------------------------------------------------------------------------------------------------------------- */

/* ---------------------------------------------------------------------------------------------------------------------------------- */
const Task3;
/*
  Създайте собствена анкета (въпроси по избор) с помощта на HTML + JS.
  Ако искате, можете да използвате и CSS, за да изглежда малко по-добре, но ще го разгледаме следващата седмица така или иначе.
  Ограничения за имплементацията няма, тъй като вариантите за решение са доста.
  Основното изискване е анкетата да е под формата на въпроси с радио бутони като отговорът може да бъде само един.
  Важно е и да има бутон за изпращане след като всички въпроси са попълнени (който например след клик да показва броя верни отговори).
  - Заб.1. HTML може да е предварително зареден с въпроси под някаква форма, които само да се обработват с JS.
  - Заб.2. Може пък и да имате прост HTML (като примера отдолу) и да добавяте динамично всичко чрез JS - изборът е ваш.
*/

/* Примерен HTML: */
<html>
  <body>
    <div id="quiz"></div>
    <button id="submit">Submit</button>
    <div id="score"></div>
  </body>
</html>
/* ---------------------------------------------------------------------------------------------------------------------------------- */
